In [1]:
import pandas as pd

In [2]:
ncov_data_cases = pd.read_html('https://www.worldometers.info/coronavirus')

In [26]:
#len(ncov_data_cases[0])
vir_df = pd.DataFrame(ncov_data_cases[0])
vir_df.shape

(164, 9)

In [28]:
vir_df[:5]

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop
0,China,80883,+23,3226.0,13.0,68688.0,8969,3226.0,56.2
1,Italy,27980,"+3,233",2158.0,349.0,2749.0,23073,1851.0,NaN
2,Iran,14991,"+1,053",853.0,129.0,4590.0,9548,NaN,247.9
3,Spain,9942,"+1,954",342.0,48.0,530.0,9070,272.0,118.4
4,S. Korea,8236,+74,75.0,NaN,1137.0,7024,59.0,176.2

In [50]:
vir_df[vir_df['Country,Other']=='Iran']

Empty DataFrame
Columns: [Country,Other, TotalCases, NewCases, TotalDeaths, NewDeaths, TotalRecovered, ActiveCases, Serious,Critical, Tot Cases/1M pop]
Index: []

In [59]:
total_cases_sum = vir_df['TotalCases'].sum()
total_cases_sum

364862

In [60]:
vir_df

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop
0,China,80883,+23,3226.0,13.0,68688.0,8969,3226.0,56.2
1,Italy,27980,"+3,233",2158.0,349.0,2749.0,23073,1851.0,NaN
2,Iran,14991,"+1,053",853.0,129.0,4590.0,9548,NaN,247.9
3,Spain,9942,"+1,954",342.0,48.0,530.0,9070,272.0,118.4
4,S. Korea,8236,+74,75.0,NaN,1137.0,7024,59.0,176.2
...,...,...,...,...,...,...,...,...,...
159,Eswatini,1,NaN,NaN,NaN,NaN,1,NaN,0.9
160,Tanzania,1,+1,NaN,NaN,NaN,1,NaN,NaN
161,Togo,1,NaN,NaN,NaN,NaN,1,NaN,0.1
162,U.S. Virgin Islands,1,NaN,NaN,NaN,NaN,1,NaN,NaN
163,Total:,182431,12867,7157.0,638.0,79211.0,96063,6163.0,23.4

In [61]:
total_cases = vir_df[vir_df['Country,Other'] == 'Total:']['TotalCases']
total_cases

163    182431
Name: TotalCases, dtype: int64

In [62]:
total_cases_sum-total_cases

163    182431
Name: TotalCases, dtype: int64

In [63]:
type(ncov_data_cases[0])

pandas.core.frame.DataFrame

In [64]:
data_age_sex_html = pd.read_html('https://www.worldometers.info/coronavirus/coronavirus-age-sex-demographics/')

In [65]:
len(data_age_sex_html)

3

In [66]:
data_age_sex_html[0]

                 0                           1                     2
0              AGE  DEATH RATE confirmed cases  DEATH RATE all cases
1    80+ years old                       21.9%                 14.8%
2  70-79 years old                         NaN                  8.0%
3  60-69 years old                         NaN                  3.6%
4  50-59 years old                         NaN                  1.3%
5  40-49 years old                         NaN                  0.4%
6  30-39 years old                         NaN                  0.2%
7  20-29 years old                         NaN                  0.2%
8  10-19 years old                         NaN                  0.2%
9    0-9 years old                         NaN         no fatalities

In [67]:
data_age_sex_html[1]

        0                           1                     2
0     SEX  DEATH RATE confirmed cases  DEATH RATE all cases
1    Male                        4.7%                  2.8%
2  Female                        2.8%                  1.7%

In [68]:
data_age_sex_html[2]

,0,1,2
0,PRE-EXISTING CONDITION,DEATH RATE confirmed cases,DEATH RATE all cases
1,Cardiovascular disease,13.2%,10.5%
2,Diabetes,9.2%,7.3%
3,Chronic respiratory disease,8.0%,6.3%
4,Hypertension,8.4%,6.0%
5,Cancer,7.6%,5.6%
6,no pre-existing conditions,NaN,0.9%